[Killed] StringLiteral
main/components/Ride/RideTable.js:59:23
         },
         {
             Header: 'Drop Off Time',
-            accessor: 'dropOffTime',
+            accessor: "",
         },
         {
killedBy: RideTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RideTable-cell-row-0-col-dropOffTime"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ObjectLiteral
main/components/Ride/RideTable.js:100:9
             Header: 'Course #',
             accessor: 'course',
         },
-        {
-            Header: 'Pick Up Time',
-            accessor: 'pickUpTime',
-        },
+        {},
         {
             Header: 'Drop Off Time',
killedBy: RideRequestIndexPage tests renders three rides without crashing for admin user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Ride/RideTable.js:102:23
         },
         {
             Header: 'Pick Up Time',
-            accessor: 'pickUpTime',
+            accessor: "",
         },
         {
killedBy: RideTable tests Has the expected column headers and content for ordinary driver
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RideTable-cell-row-0-col-pickUpTime"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/Ride/RideTable.js:180:30
 
     const buttonColumnsRider = [
         ...columnsRider,
-        ButtonColumn("Edit", "primary", editCallback, "RideTable"),
+        ButtonColumn("Edit", "", editCallback, "RideTable"),
         ButtonColumn("Delete", "danger", deleteCallback, "RideTable")
     ]
killedBy: RideTable tests Has the expected column headers and content for ordinary rider
statusReason: Error: expect(element).toHaveClass("btn-primary")

Expected the element to have class:
  btn-primary
Received:
  btn
