[Timeout] ConditionalExpression
main/components/Nav/AppNavbar.js:77:17
                 )
               }
               {
-                hasRole(currentUser, "ROLE_ADMIN") && (
-                  <NavDropdown title="Admin" id="appnavbar-admin-dropdown" data-testid="appnavbar-admin-dropdown" >
-                    <NavDropdown.Item as={Link} to="/admin/users">Users</NavDropdown.Item>
-                    <NavDropdown.Item as={Link} to="/admin/driverAvailability">Driver Availabilities</NavDropdown.Item>
-                    <NavDropdown.Item as={Link} to="/admin/applications/riders">Rider Applications</NavDropdown.Item>
-                  </NavDropdown>
-                )
+                true
               }
               {

[Timeout] ConditionalExpression
main/components/Nav/AppNavbar.js:77:17
                 )
               }
               {
-                hasRole(currentUser, "ROLE_ADMIN") && (
-                  <NavDropdown title="Admin" id="appnavbar-admin-dropdown" data-testid="appnavbar-admin-dropdown" >
-                    <NavDropdown.Item as={Link} to="/admin/users">Users</NavDropdown.Item>
-                    <NavDropdown.Item as={Link} to="/admin/driverAvailability">Driver Availabilities</NavDropdown.Item>
-                    <NavDropdown.Item as={Link} to="/admin/applications/riders">Rider Applications</NavDropdown.Item>
-                  </NavDropdown>
-                )
+                false
               }
               {

[Timeout] LogicalOperator
main/components/Nav/AppNavbar.js:93:17
                 )
               }
               {
-                isParticipant(currentUser) && (
-                  <NavDropdown title="Shifts" id="appnavbar-shift-dropdown" data-testid="appnavbar-shift-dropdown" >
-                    <NavDropdown.Item data-testid="appnavbar-shift-dropdown-shifts" as={Link} to="/shift/">Shifts</NavDropdown.Item>
-                    <NavDropdown.Item data-testid="appnavbar-availability-dropdown-availabilities" as={Link} to="/availability/">Availability</NavDropdown.Item>
-                  </NavDropdown>
-                )
+                isParticipant(currentUser) || <NavDropdown title="Shifts" id="appnavbar-shift-dropdown" data-testid="appnavbar-shift-dropdown">
+                    <NavDropdown.Item data-testid="appnavbar-shift-dropdown-shifts" as={Link} to="/shift/">Shifts</NavDropdown.Item>
+                    <NavDropdown.Item data-testid="appnavbar-availability-dropdown-availabilities" as={Link} to="/availability/">Availability</NavDropdown.Item>
+                  </NavDropdown>
               }
               {

[Timeout] ConditionalExpression
main/components/Nav/AppNavbar.js:93:17
                 )
               }
               {
-                isParticipant(currentUser) && (
-                  <NavDropdown title="Shifts" id="appnavbar-shift-dropdown" data-testid="appnavbar-shift-dropdown" >
-                    <NavDropdown.Item data-testid="appnavbar-shift-dropdown-shifts" as={Link} to="/shift/">Shifts</NavDropdown.Item>
-                    <NavDropdown.Item data-testid="appnavbar-availability-dropdown-availabilities" as={Link} to="/availability/">Availability</NavDropdown.Item>
-                  </NavDropdown>
-                )
+                false
               }
               {

[Timeout] ConditionalExpression
main/components/Nav/AppNavbar.js:121:17
                 )
               }
               {
-                !hasRole(currentUser, "ROLE_RIDER") && (
-                  <Nav.Link id ="appnavbar-applytobearider-link" data-testid="appnavbar-applytoberider" as={Link} to="/apply/rider">Apply to be a Rider</Nav.Link>
-                )
+                true
               }
 

[Timeout] LogicalOperator
main/components/Nav/AppNavbar.js:121:17
                 )
               }
               {
-                !hasRole(currentUser, "ROLE_RIDER") && (
-                  <Nav.Link id ="appnavbar-applytobearider-link" data-testid="appnavbar-applytoberider" as={Link} to="/apply/rider">Apply to be a Rider</Nav.Link>
-                )
+                !hasRole(currentUser, "ROLE_RIDER") || <Nav.Link id="appnavbar-applytobearider-link" data-testid="appnavbar-applytoberider" as={Link} to="/apply/rider">Apply to be a Rider</Nav.Link>
               }
 
