[Killed] ObjectLiteral
main/components/Ride/RideTable.js:66:9
             Header: 'Pick Up Time',
             accessor: 'pickUpTime',
         },
-        {
-            Header: 'Drop Off Time',
-            accessor: 'dropOffTime',
-        },
+        {},
         {
             Header: 'Pick Up Building',
killedBy: RideRequestIndexPage tests renders three rides without crashing for admin user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Ride/RideTable.js:200:22
     const buttonColumnsAdmin = [
         ...columns,
         ButtonColumn("Edit", "primary", editCallback, "RideTable"),
-        ButtonColumn("Delete", "danger", deleteCallback, "RideTable"),
+        ButtonColumn("", "danger", deleteCallback, "RideTable"),
         ButtonColumn("Assign Driver", "success", assignCallback, "RideTable")
     ]
killedBy: RideTable tests renders without crashing for empty table for admin
statusReason: Error: A column ID (or string accessor) is required!
