[Killed] BlockStatement
main/components/Shift/ShiftTable.js:21:36
         navigate(`/shift/edit/${cell.row.values.id}`)
     }
 
-    const infoCallback = (cell) => {
-        navigate(`/shiftInfo/${cell.row.values.id}`)
-    }
+    const infoCallback = (cell) => {}
 
     // Stryker disable all : hard to test for query caching
killedBy: ShiftTable tests Info button triggers navigation
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/shiftInfo/1"

Number of calls: 0

[Killed] ObjectLiteral
main/components/Shift/ShiftTable.js:46:9
             Header: 'Day',
             accessor: 'day',
         },
-        {
-            Header: 'Shift start',
-            accessor: 'shiftStart',
-        },
+        {},
         {
             Header: 'Shift end',
killedBy: ShiftTable tests renders without crashing for empty table
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Shift/ShiftTable.js:51:21
             accessor: 'shiftStart',
         },
         {
-            Header: 'Shift end',
+            Header: "",
             accessor: 'shiftEnd',
         },
killedBy: ShiftTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element with the text: Shift end. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ArrowFunction
main/components/Shift/ShiftTable.js:57:19
         {
             Header: 'Driver',
             accessor: 'driverID',
-            Cell: ({ value }) => (
-                // Stryker disable next-line all : hard to set up test
-                <Link to={`/driverInfo/${value}`}>{value}</Link>
-              ),
+            Cell: () => undefined,
         },
         {
killedBy: ShiftTable tests renders without crashing for three shifts
statusReason: Error: Component(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] ObjectLiteral
main/components/Shift/ShiftTable.js:62:9
                 <Link to={`/driverInfo/${value}`}>{value}</Link>
               ),
         },
-        {
-            Header: 'Backup driver',
-            accessor: 'driverBackupID',
-            Cell: ({ value }) => (
-                // Stryker disable next-line all : hard to set up test
-                <Link to={`/driverInfo/${value}`}>{value}</Link>
-              ),
-        }
+        {}
     ];
 
killedBy: ShiftTable tests renders without crashing for empty table
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Shift/ShiftTable.js:63:21
               ),
         },
         {
-            Header: 'Backup driver',
+            Header: "",
             accessor: 'driverBackupID',
             Cell: ({ value }) => (
killedBy: ShiftTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element with the text: Backup driver. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ArrowFunction
main/components/Shift/ShiftTable.js:65:19
         {
             Header: 'Backup driver',
             accessor: 'driverBackupID',
-            Cell: ({ value }) => (
-                // Stryker disable next-line all : hard to set up test
-                <Link to={`/driverInfo/${value}`}>{value}</Link>
-              ),
+            Cell: () => undefined,
         }
     ];
killedBy: ShiftTable tests renders without crashing for three shifts
statusReason: Error: Component(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] ConditionalExpression
main/components/Shift/ShiftTable.js:77:9
         columns.push(ButtonColumn("Delete", "danger", deleteCallback, testIdPrefix));
     }
     
-    if (hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_DRIVER")) {
+    if (false) {
         columns.push(ButtonColumn("Info", "success", infoCallback, testIdPrefix))
     }
killedBy: ShiftTable tests Has the expected column headers, content, and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ShiftTable-cell-row-0-col-Info-button"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] LogicalOperator
main/components/Shift/ShiftTable.js:77:9
         columns.push(ButtonColumn("Delete", "danger", deleteCallback, testIdPrefix));
     }
     
-    if (hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_DRIVER")) {
+    if (hasRole(currentUser, "ROLE_ADMIN") && hasRole(currentUser, "ROLE_DRIVER")) {
         columns.push(ButtonColumn("Info", "success", infoCallback, testIdPrefix))
     }
killedBy: ShiftTable tests Has the expected column headers, content, and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ShiftTable-cell-row-0-col-Info-button"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >
