[Killed] ArrowFunction
main/pages/Ride/RideRequestAssignPage.js:26:34
     );
 
 
-  const objectToAxiosPutParams = (ride) => ({
-    url: "/api/ride_request/assigndriver",
-    method: "PUT",
-    params: {
-      id: ride.id,
-    },
-    data: {
-        shiftId: ride.shiftId,
-    }
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (ride) => {
killedBy: RideRequestAssignPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/pages/Ride/RideRequestAssignPage.js:27:10
 
 
   const objectToAxiosPutParams = (ride) => ({
-    url: "/api/ride_request/assigndriver",
+    url: "",
     method: "PUT",
     params: {
killedBy: RideRequestAssignPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/pages/Ride/RideRequestAssignPage.js:28:13
 
   const objectToAxiosPutParams = (ride) => ({
     url: "/api/ride_request/assigndriver",
-    method: "PUT",
+    method: "",
     params: {
       id: ride.id,
killedBy: RideRequestAssignPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
main/pages/Ride/RideRequestAssignPage.js:32:11
     params: {
       id: ride.id,
     },
-    data: {
-        shiftId: ride.shiftId,
-    }
+    data: {}
   });
 
killedBy: RideRequestAssignPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "{\"shiftId\":\"3\"}"
Received: "{}"

[Killed] BlockStatement
main/pages/Ride/RideRequestAssignPage.js:37:31
     }
   });
 
-  const onSuccess = (ride) => {
-    toast(`Driver Assigned - id: ${ride.id}`);
-  }
+  const onSuccess = (ride) => {}
 
   const mutation = useBackendMutation(
killedBy: RideRequestAssignPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] ConditionalExpression
main/pages/Ride/RideRequestAssignPage.js:62:18
         <BasicLayout>
             <div className="pt-2">
                 <h1>Assign Driver to Ride Request</h1>
-                {ride &&
-                <RideAssignDriverForm initialContents={ride} submitAction={onSubmit} buttonLabel="Assign Driver" />
+                {true
                 }
             </div>
killedBy: RideRequestAssignPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="RideAssignDriverForm-day"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] LogicalOperator
main/pages/Ride/RideRequestAssignPage.js:62:18
         <BasicLayout>
             <div className="pt-2">
                 <h1>Assign Driver to Ride Request</h1>
-                {ride &&
-                <RideAssignDriverForm initialContents={ride} submitAction={onSubmit} buttonLabel="Assign Driver" />
+                {ride || <RideAssignDriverForm initialContents={ride} submitAction={onSubmit} buttonLabel="Assign Driver" />
                 }
             </div>
killedBy: RideRequestAssignPage tests when the backend doesn't return a todo renders header but table is not present
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <input class="form-control" data-testid="RideAssignDriverForm-day" disabled="" id="day" name="day" value="" /> instead
