[Killed] BlockStatement
main/components/Shift/ShiftInfo.js:4:30
 import React from 'react';
 import Card from 'react-bootstrap/Card';
 
-function ShiftInfo({ info }) {
-  return (
-    <Card data-testid="DriverInfo">
-      <Card.Body>
-          <Card.Title>{'Id: ' + info.id}</Card.Title>
-          <Card.Title>{'Day: ' + info.day}</Card.Title>
-          <Card.Title>{'Start: ' + info.shiftStart}</Card.Title>
-          <Card.Title>{'End: ' + info.shiftEnd}</Card.Title>
-          <Card.Title>{'Driver Id: ' + info.driverID}</Card.Title>
-          <Card.Title>{'Driver Backup Id: ' + info.driverBackupID}</Card.Title>
-      </Card.Body>
-    </Card>
-  );
-}
+function ShiftInfo({ info }) {}
 
 export default ShiftInfo;
killedBy: ShiftInfoPage tests on submit
statusReason: Error: ShiftInfo(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] StringLiteral
main/components/Shift/ShiftInfo.js:8:24
   return (
     <Card data-testid="DriverInfo">
       <Card.Body>
-          <Card.Title>{'Id: ' + info.id}</Card.Title>
+          <Card.Title>{"" + info.id}</Card.Title>
           <Card.Title>{'Day: ' + info.day}</Card.Title>
           <Card.Title>{'Start: ' + info.shiftStart}</Card.Title>
killedBy: ShiftInfoPage tests on submit
statusReason: Error: Unable to find an element with the text: Id: 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] StringLiteral
main/components/Shift/ShiftInfo.js:13:24
           <Card.Title>{'Start: ' + info.shiftStart}</Card.Title>
           <Card.Title>{'End: ' + info.shiftEnd}</Card.Title>
           <Card.Title>{'Driver Id: ' + info.driverID}</Card.Title>
-          <Card.Title>{'Driver Backup Id: ' + info.driverBackupID}</Card.Title>
+          <Card.Title>{"" + info.driverBackupID}</Card.Title>
       </Card.Body>
     </Card>
killedBy: ShiftInfoPage tests on submit
statusReason: Error: Unable to find an element with the text: Driver Backup Id: 4. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
