[Killed] ArrowFunction
main/pages/RiderApplication/RiderApplicationEditPageAdmin.js:26:34
     );
 
 
-  const objectToAxiosPutParams = (riderApplication) => ({
-    url: "/api/riderApplication",
-    method: "PUT",
-    params: {
-      id: riderApplication.id,
-    },
-    data: {
-        perm_number: riderApplication.perm_number,
-        description: riderApplication.description,
-        notes: riderApplication.notes,
-        status: riderApplication.status,
-    }
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (riderApplication) => {
killedBy: RiderApplicationEditPageAdmin tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
main/pages/RiderApplication/RiderApplicationEditPageAdmin.js:26:57
     );
 
 
-  const objectToAxiosPutParams = (riderApplication) => ({
-    url: "/api/riderApplication",
-    method: "PUT",
-    params: {
-      id: riderApplication.id,
-    },
-    data: {
-        perm_number: riderApplication.perm_number,
-        description: riderApplication.description,
-        notes: riderApplication.notes,
-        status: riderApplication.status,
-    }
-  });
+  const objectToAxiosPutParams = (riderApplication) => ({});
 
   const onSuccess = (riderApplication) => {
killedBy: RiderApplicationEditPageAdmin tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/pages/RiderApplication/RiderApplicationEditPageAdmin.js:27:10
 
 
   const objectToAxiosPutParams = (riderApplication) => ({
-    url: "/api/riderApplication",
+    url: "",
     method: "PUT",
     params: {
killedBy: RiderApplicationEditPageAdmin tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
main/pages/RiderApplication/RiderApplicationEditPageAdmin.js:32:11
     params: {
       id: riderApplication.id,
     },
-    data: {
-        perm_number: riderApplication.perm_number,
-        description: riderApplication.description,
-        notes: riderApplication.notes,
-        status: riderApplication.status,
-    }
+    data: {}
   });
 
killedBy: RiderApplicationEditPageAdmin tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "{\"perm_number\":\"1234567\",\"description\":\"\",\"notes\":\"approving\",\"status\":\"pending\"}"
Received: "{}"

[Killed] LogicalOperator
main/pages/RiderApplication/RiderApplicationEditPageAdmin.js:65:18
         <BasicLayout>
             <div className="pt-2">
                 <h1>Edit Rider Application</h1>
-                {riderApplication &&
-                <RiderApplicationEditForm initialContents={riderApplication} submitAction={onSubmit} />
+                {riderApplication || <RiderApplicationEditForm initialContents={riderApplication} submitAction={onSubmit} />
                 }
             </div>
killedBy: RiderApplicationEditPageAdmin tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Objects are not valid as a React child (found: object with keys {id, perm_number, status, email, created_date, updated_date, cancelled_date, description, notes}). If you meant to render a collection of children, use an array instead.

[Killed] ConditionalExpression
main/pages/RiderApplication/RiderApplicationEditPageAdmin.js:65:18
         <BasicLayout>
             <div className="pt-2">
                 <h1>Edit Rider Application</h1>
-                {riderApplication &&
-                <RiderApplicationEditForm initialContents={riderApplication} submitAction={onSubmit} />
+                {true
                 }
             </div>
killedBy: RiderApplicationEditPageAdmin tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="RiderApplicationEditForm-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
