[Killed] BlockStatement
main/pages/RiderApplication/RiderApplicationEditPageMember.js:57:18
     mutation.mutate(data);
   }
 
-  if (isSuccess) {
-    return <Navigate to="/apply/rider" />
-  }
+  if (isSuccess) {}
 
     return (
killedBy: RiderApplicationEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/apply/rider"}

Number of calls: 0

[Killed] LogicalOperator
main/pages/RiderApplication/RiderApplicationEditPageMember.js:65:18
         <BasicLayout>
             <div className="pt-2">
                 <h1>Edit Rider Application</h1>
-                {riderApplication &&
-                <RiderApplicationForm initialContents={riderApplication} submitAction={onSubmit} buttonLabel="Edit" />
+                {riderApplication || <RiderApplicationForm initialContents={riderApplication} submitAction={onSubmit} buttonLabel="Edit" />
                 }
             </div>
killedBy: RiderApplicationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Objects are not valid as a React child (found: object with keys {id, perm_number, status, email, created_date, updated_date, cancelled_date, description, notes}). If you meant to render a collection of children, use an array instead.
