[Killed] ConditionalExpression
main/pages/RiderApplication/RiderApplicationShowPageMember.js:27:18
         <BasicLayout>
             <div className="pt-2">
                 <h1>Show Rider Application</h1>
-                {riderApplication &&
-                <RiderApplicationShowForm initialContents={riderApplication}  buttonLabel="Back" />
+                {false
                 }
             </div>
killedBy: RiderApplicationShowPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="RiderApplicationShowForm-status"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ConditionalExpression
main/pages/RiderApplication/RiderApplicationShowPageMember.js:27:18
         <BasicLayout>
             <div className="pt-2">
                 <h1>Show Rider Application</h1>
-                {riderApplication &&
-                <RiderApplicationShowForm initialContents={riderApplication}  buttonLabel="Back" />
+                {true
                 }
             </div>
killedBy: RiderApplicationShowPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="RiderApplicationShowForm-status"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
