[Killed] StringLiteral
main/components/Driver/DriverAvailabilityTable.js:16:18
     const navigate = useNavigate();
 
     const editCallback = (cell) => {
-        navigate(`/availability/edit/${cell.row.values.id}`)
+        navigate(``)
     }
 
killedBy: DriverAvailabilityTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/availability/edit/1"
Received: ""

Number of calls: 1

<html>

[Killed] BlockStatement
main/components/Driver/DriverAvailabilityTable.js:19:38
         navigate(`/availability/edit/${cell.row.values.id}`)
     }
 
-    const reviewCallback = (cell) => {
-        navigate(`/availability/review/${cell.row.values.id}`)
-    }
+    const reviewCallback = (cell) => {}
 
     // Stryker disable all : hard to test for query caching
killedBy: DriverAvailabilityTable tests Review button triggers navigation
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/availability/review/1"

Number of calls: 0

[Killed] StringLiteral
main/components/Driver/DriverAvailabilityTable.js:41:21
             accessor: 'id', // accessor is the "key" in the data
         },
         {
-            Header: 'driverId',
+            Header: "",
             accessor: 'driverId',
         },
killedBy: DriverAvailabilityTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element with the text: driverId. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/Driver/DriverAvailabilityTable.js:54:23
         },
         {
             Header: 'endTime',
-            accessor: 'endTime',
+            accessor: "",
         },
         {
killedBy: DriverAvailabilityIndexPage tests renders three DriverAvailabilitys correctly for regular user
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  12:00PM
Received:

[Killed] ObjectLiteral
main/components/Driver/DriverAvailabilityTable.js:56:9
             Header: 'endTime',
             accessor: 'endTime',
         },
-        {
-            Header: 'notes',
-            accessor: 'notes',
-        }
+        {}
     ];
 
killedBy: DriverAvailabilityTable tests renders without crashing for empty table
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Driver/DriverAvailabilityTable.js:57:21
             accessor: 'endTime',
         },
         {
-            Header: 'notes',
+            Header: "",
             accessor: 'notes',
         }
killedBy: DriverAvailabilityTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element with the text: notes. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/Driver/DriverAvailabilityTable.js:74:112
         ButtonColumn("Review", "primary", reviewCallback, "DriverAvailabilityTable")
     ];
     // Stryker restore all
-    const columnsToDisplay = (hasRole(currentUser, "ROLE_ADMIN")) ? buttonColumnsAdmin : (hasRole(currentUser, "ROLE_DRIVER")) ? buttonColumnsDriver : columns;
+    const columnsToDisplay = (hasRole(currentUser, "ROLE_ADMIN")) ? buttonColumnsAdmin : (hasRole(currentUser, "")) ? buttonColumnsDriver : columns;
 
     return <OurTable
killedBy: DriverAvailabilityIndexPage tests renders three DriverAvailabilitys correctly for regular user
statusReason: Error: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has value: null
