[Killed] BlockStatement
src/main/utils/driverAvailabilityUtils.js:8:47
     toast(message);
 }
 
-export function cellToAxiosParamsDelete(cell) {
-    return {
-        url: "/api/driverAvailability",
-        method: "DELETE",
-        params: {
-            id: cell.row.values.id
-        }
-    }
-}
+export function cellToAxiosParamsDelete(cell) {}
killedBy: DriverAvailabilityIndexPage tests what happens when you click delete, driver
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "DriverAvailability with id 1 was deleted"

Number of calls: 0

<html>
  <head />
